
format_string = "%Y-%m-%d %H:%M"
org_time = {"start_jereb": "2023-12-13 00:00"}

admins = [209851077, 465051443, 325484003, 223300946, 24269315, 263035630, 672534290, 122712358]

text_ded_moroz = "Хо-хо-хо, здравствуй, мой дорогой друг!\n\n \
    Уж если ты здесь, значит, собрался-таки творить маленькие чудеса для математических товарищей своих🤗\n\n\
    Записаться в мои помощники можно с 7 по 12 декабря включительно. Пока на часах не пробьёт полночь — можно и отступиться, но коль воля твоя крепка, уже 13 числа сего месяца решу я, кто станет твоим подопечным да чьим подопечным окажешься ты. А после начнёт свой отсчёт неделя на то, чтобы подарок приготовить: с утра 20-го по вечер 22 декабря ты сможешь передать его моим оленям-почтальонам на этаже математиков, а взамен получить свой 🦌\n\n\
    Про важные события я буду сообщать тебе здесь: от глаза моего не укроется ни то, что для тебя уж подарок готов, ни то, что приготовленный тобою достиг адресата. А коль запаздывать будешь — напомню да пожурю."

text_start_jereb = "Приветствую тебя, мой математический друг!\n\n\
Целую неделю я собирал все пожелания и искал людей, желающих впустить волшебство в свою жизнь, а потому не писал тебе. Однако, вернулся с чудесными новостями!\n\n\
Прямо сейчас ты узнаешь кого именно осчастливишь в этот праздник! Как только ты увидишь имя его — начинай готовить подарок, да передавай его моим верным оленям 20, 21 и 22 декабря: они будут ждать тебя каждый день на большом перерыве у математического лифта.\n\n\
В ответ на подготовленный тобой подарок мои почтальоны вручат новогоднее чудо, предназначающееся тебе. И не забывай — лучший подарок тот, что сделан искренне и с душой💛"

text_za_dva_dnya = "Ну что ж, дружище, надеюсь, подарок твой почти готов: лишь два дня осталось до его вручения адресату — поторопиться надобно❄"

text_priem_podark = "Доброе утро, волшебник! Сегодня твой подарок надобно отнести в пункт сбора — тот, что у лифта на этаже математиков. Да не задерживайся слишком: чудо — оно на то и чудо, чтоб с ним не затягивать!"

text_prines_podarok = "Спасибо за работу, юный друг! Твой подарок забрали мои помощники — северные олени: уже завтра он будет доставлен адресату и принесёт ему целый сугроб радости! Да и ты жди весточку от своего тайного дарителя: интересно, что он для тебя приготовил?"